student_api/app/controllers/student_controller.rb

SELECT "students".* FROM "students"
---
  def index
    logger.debug "inside index"
    render json: Student.all

INSERT INTO "students" ("name", "subject", "grade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "pranee"], ["subject", "ruby"], ["grade", "A"], ["created_at", "2017-12-06 09:18:31.052867"], ["updated_at", "2017-12-06 09:18:31.052867"]]
---
  def create
    logger.debug "inside create"
    @student = Student.new(student_params)
    if @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "varun"], ["updated_at", "2017-12-06 09:38:27.906382"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
  def destroy
    @student = Student.find(params[:id])
    if @student.destroy